Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: If the server fails to authenticate the user (through the underlying authentication mechanism(s)), it SHOULD NOT send another request message(s) in an attempt to obtain new authentication data; instead, it SHOULD send a failure message.
ja: (基盤となっている認証メカニズムを通して) サーバがユーザの認証に失敗したなら, 新しい認証データを得ようとして 別の要求メッセージを送らないほうがよい. 代わりに 失敗メッセージを送る必要がある.

source: The server MUST reply with an SSH_MSG_USERAUTH_SUCCESS, SSH_MSG_USERAUTH_FAILURE, or SSH_MSG_USERAUTH_INFO_REQUEST message.
ja: サーバは, SSH_MSG_USERAUTH_SUCCESS か, SSH_MSG_USERAUTH_FAILURE, SSH_MSG_USERAUTH_INFO_REQUEST メッセージで応答しなければならない.

source: Fingerprint Matching .......................................3 2.4.
ja: 指紋の一致 .......................................3 2.4.

source: Requests and Responses
ja: 要求と応答

source: The fingerprint type octet describes the message-digest algorithm used to calculate the fingerprint of the public key.
ja: 指紋の種類のオクテットは, 公開鍵の指紋を計算するのに使われるメッセージダイジェストアルゴリズムを記述する.

source: The 'comments' string is OPTIONAL.
ja: 'comments' 文字列の存在は選択できる.

source: Implementations of mechanisms conforming to this document MUST NOT use the results of insecure DNS queries to construct the targ_name.
ja: この文書に従うメカニズムの実装者は, targ_name の構築に安全でないDNSクエリの結果を用いてはならない.

source: o The SSH public key algorithm "x509v3-ssh-rsa".
ja: o SSH 公開鍵アルゴリズム "x509v3-ssh-rsa".

source: This public key MUST be used to authenticate the server to the host using ECDSA-256 or ECDSA-384 as appropriate (see Section 3).
ja: この公開鍵は, 必要に応じて ECDSA-256 か ECDSA-384 を用いるホストへサーバを認証するのに用いられなければならない(3節を参照).

source: This document defines a new family of key exchange method names, a new key exchange method name, and a new family of public key algorithm names in the SSH name registry.
ja: この文章は, 鍵交換の方法名の新しいファミリや新しい鍵交換法の名前, 公開鍵アルゴリズムの新しいファミリを SSHの名前レジストリに定義する.

source: Different kex methods may reuse message numbers in this range.
ja: 異なる鍵交換法は, この範囲のメッセージ番号を再利用する.

source: However, already opened forwardings should not be automatically closed when the session channel is closed.
ja: しかし, すでに開始されている転送は, セッションが終了されても自動的には終了されないべきだ.

source: AES GCM Algorithms for Secure Shell
ja: セキュアシェルのための AES GCM アルゴリズム

source: The initial contents of the registry are as follows:
ja: レジルトリの最初の内容は以下だ:

source: snmpSshtmGroup OBJECT-GROUP OBJECTS { snmpSshtmSessionOpens, snmpSshtmSessionCloses, snmpSshtmSessionOpenErrors, snmpSshtmSessionUserAuthFailures, snmpSshtmSessionNoChannels, snmpSshtmSessionNoSubsystems, snmpSshtmSessionNoSessions, snmpSshtmSessionInvalidCaches } STATUS current DESCRIPTION "A collection of objects for maintaining information of an SNMP engine that implements the SNMP Secure Shell Transport Model.
ja: snmpSshtmGroup OBJECT-GROUP OBJECTS { snmpSshtmSessionOpens, snmpSshtmSessionCloses, snmpSshtmSessionOpenErrors, snmpSshtmSessionUserAuthFailures, snmpSshtmSessionNoChannels, snmpSshtmSessionNoSubsystems, snmpSshtmSessionNoSessions, snmpSshtmSessionInvalidCaches } STATUS current DESCRIPTION "SNMP セキュアシェルトランスポートモデルを実装する SNMP エンジンの情報を維持するオブジェクトの集合.

source: All non-zero values MUST be interpreted as TRUE; however, applications MUST NOT store values other than 0 and 1.
ja: すべての 0 でない値は TRUE と解釈されなければならない.; しかし, アプリケーションは, 0 か 1 以外の値を格納してはならない.

source: Section 3 of this document makes two rekeying recommendations: (1) rekey at least once every 2**32 packets, and (2) rekey after a certain number of encrypted blocks (e.g., 2**(L/4) blocks if the block cipher's block length L is at least 128 bits).
ja: この文書の3節で, 2つの鍵の再発行の推奨を示した: (1) 少なくとも 2**32 パケットごとの再発行, (2) 暗号化されたブロックが特定の数(例えば, ブロック暗号のブロック長 L が少なくとも128 bitなら, 2**(L/4) ブロック) に逹したら再発行.

source: The SSH specifications leave it open when window adjustment messages should be created, and some implementations send these whenever received data has been passed to the application.
ja: window 調整メッセージが作られるべき際に, SSH の仕様は, window メカニズムを開放したままにする. いくつかの実装は, アプリケーションに渡されるデータを受信する度に window 調整メッセージを送る.

source: Note that the decimal representation is displayed in this table for readability, but the values are actually uint32 values.
ja: この表では読み易いように10進で表記されているが, 実際にはuint32の値であることに注意.

source: When this flag is on, the server SHOULD identify its 'protoversion' as "1.99".
ja: このフラグが有効ならば, サーバは 'protoversion' を "1.99" とする必要がある.

source: The client sends a service request once a secure transport layer connection has been established.
ja: 安全なトランスポート層の接続が確立した時点で, クライアントはサービスの要求を送る.

source: In addition, a reverse proxy forwarding functionality is available, which, again, can be used to bypass firewall controls.
ja: 加えて, 逆方向のプロキシ転送機能が有効だと, これもまたファイアウォールの制御を回避するのに利用されうる.

source: If there is data in response to the request, the status packet is sent after all data has been sent.
ja: 要求に対するデータが送られる場合は, すべてのデータが送られたあとで状態パケットが送られる.

source: To continue the example used in Section 4.2, an existing NETCONF subsystem session could be closed as follows:
ja: 4.2 節で利用した例に続いて, 既存の NETCONF サブシステムを終了する例は以下だ:

source: Protocol Fields and Values
ja: プロトコルのフィールドと値

source: and the format of the SSH_MSG_KEXECDH_INIT message is:
ja: また, SSH_MSG_KEXECDH_INIT メッセージの形式は以下だ:

source: Message Stream Modification - SSH protects against malicious re- ordering or replaying of messages within a single SSH session by using sequence numbers and integrity checks.
ja: メッセージストリームの改竄 - SSH は, シーケンス番号と完全性の検査により 単一の SSH セッションでの悪意のあるメッセージの並び換えや再送に対する保護を行なう.

source: However, if the client reads the password in some other encoding (e.g., ISO 8859-1 - ISO Latin1), it MUST convert the password to ISO-10646 UTF-8 before transmitting, and the server MUST convert the password to the encoding used on that system for passwords.
ja: しかし, クライアントが別のエンコーディング (たとえば, ISO 8859-1 - ISO Latin1)でパスワードを取得したなら, 転送前にパスワードを ISO-10646 UTF-8 に変換しなければならない. また. サーバは, システムがパスワードに利用しているエンコーディングにパスワードを変換しなければならない.

source: Thus, it can be used only with key exchange methods that do not require any public-key operations and do not require the use of host public key material.
ja: それゆえ, 公開鍵操作が必要ではない鍵交換法とホスト鍵素材の利用が必要でない鍵交換法とともにのみ利用できる.

source: This will allow administrators to determine how much trust they want to place in the different methods.
ja: それぞれの方法をどれくらい信用するかについても管理者が決められるようになるだろう.

source: o All algorithms are used with cryptographically sound key sizes that are believed to provide protection against even the strongest cryptanalytic attacks for decades.
ja: o すべてのアルゴリズムには, 最も強い暗号解析攻撃にさえ数十年の保護提供すると考えられr暗号学的に安全な鍵のサイズを利用する.

source: In particular, it defines objects for monitoring and managing the Secure Shell Transport Model for SNMP.
ja: 具体的には, SNMP のためのセキュアシェルトランスポートモデルを監視し管理するオブジェクトを定義する.

source: This document also recommends that servers be configurable to allow access to the "netconf" SSH subsystem over other ports.
ja: この文書は, 他のポートでの "netconf" SSH サブシステムへのアクセスをサーバが設定可能にすることも推奨する.

source: 5) ECDSA-384 MAY be used to sign an ECDSA-256 public key.
ja: 5) ECDSA-384 は, ECDSA-256 公開鍵を署名するのに用いられてもよい.

source: This session identifier MUST NOT be reused until there are no references to it remaining.
ja: このセッション識別子は, 参照がなくなるまで再利用してはならない.

source: These curves SHOULD always be enabled unless specifically disabled by local security policy.
ja: これらの曲線は, ローカルなセキュリティポリシーで明示的に無効にされていない限り, 常に有効である必要がある.

source: Recommended Curves .......................................17 11.
ja: 推奨される曲線 .......................................17 11.

source: In situations where management access has to be very reliable, operators should consider mitigating measures.
ja: 管理のアクセスが非常に信頼できるようにしなければならない状況では, 運用者は軽減策を考慮すべきだ.

source: This key exchange method provides implicit server authentication as defined in [RFC4253].
ja: この鍵交換法は, [RFC4253]で定義された暗黙的なサーバ認証を提供する.

source: In the Public Key Algorithm Names registry:
ja: 公開鍵アルゴリズム名レジストリ内に:

source: In any case, if the service does not exist, authentication MUST NOT be accepted.
ja: どちらにせよ, サービスが存在しないなら, 認証を受け入れてはならない.

source: string public_key_algorithm_name // x509v3-ecdsa-sha2-nistp256 // or x509v3-ecdsa-sha2-nistp384
ja: string public_key_algorithm_name // x509v3-ecdsa-sha2-nistp256 // ないし x509v3-ecdsa-sha2-nistp384

source: Elements of Procedure ..........................................14 5.1.
ja: 手順の要素 ..........................................14 5.1.

source: The discarded bytes of keystream MUST be kept secret and MUST NOT be transmitted over the network.
ja: 鍵ストリームの破棄されるバイト列は, 秘密にしなければならない. またネットワーク越しに転送してはならない.

source: Note that the responses are encoded in ISO-10646 UTF-8.
ja: response は ISO-10646 UTF-8 でエンコードされることに注意.

source: If this is a server-side SSH session and this is the first message received over the session, then the tmSecurityName is set to the SSH user name.
ja: サーバ側のSSHのセッションの場合でこれがセッションを介して受信した最初のメッセージならば, tmSecurityName は, SSHのユーザ名に設定される.

source: Section 3.3 defines a new namespace of "Header-tags".
ja: 3.3 節で新しい名前空間 "Header-tags" を定義している.

source: When using AES-GCM with secure shell, the packet_length field is to be treated as additional authenticated data, not as plaintext.
ja: セキュアシェルと共に AES-GCM を用いる場合, packet_length フィールドは 追加の認証されるデータ (additional authenticated data) として扱い平文としては扱われないようにする.

source: This certificate, a chain of certificates leading to a trusted certificate authority, and optional messages giving the revocation status of the certificates are sent as the public key data in the Secure Shell protocol according to the format in this section.
ja: この証明書と, 信用される認証局につながる証明書のチェーン, 証明書の失効状態を与えるオプションのメッセージは, セキュアシェルプロトコルでこの節で述べる形式に従って公開鍵データとして送られる.

source: The message hashing algorithm MUST be from the SHA2 family of hash functions [FIPS-180-3] and is chosen according to the curve size as specified in Section 6.2.1.
ja: メッセージハッシュアルゴリズムは, SHA2 ファミリーのハッシュ関数 [FIPS-180-3] のものでなければならない. 6.2.1節で指定される曲線のサイズに応じて, ハッシュアルゴリズムは選ばれる.

source: * If the resulting major_status code is GSS_S_CONTINUE_NEEDED, the output_token is sent to S, which will reply with a new token to be provided to GSS_Init_sec_context().
ja: * 結果の major_status コードが GSS_S_CONTINUE_NEEDED なら, Sに output_token を送り, Sは GSS_Init_sec_context() に提供される新しい token で応答する.

source: 71 OLCUC Convert lowercase to uppercase.
ja: 71 OLCUC 小文字を大文字に変換する.

source: Generic GSS-API Key Exchange ...............................4 2.2.
ja: 汎用 GSS-API 鍵交換 ...............................4 2.2.

source: Removing a Public Key .
ja: 公開鍵の削除 .

source: This authorization is performed before the message is actually sent and before the credentials of the remote receiver have been verified.
ja: この認可は, メッセージが実際に送られる前, また, リモートの受信者の資格情報が検証される前に実行される.

source: Of these, the range 192 to 255 is reserved for use by local, private extensions.
ja: このうち, 192から 255 はローカルでプライベートな拡張での利用のため予約されている.

source: The X Protocol is documented in [SCHEIFLER].
ja: X のプロトコルは, [SCHEIFLER] に記述されている.

source: Choose the first algorithm that satisfies the following conditions:
ja: 次の条件を満たす最初のアルゴリズムを選択する:

source: Opening a Session
ja: セッションの開始

source: flush an authentication state, it MUST disconnect if the 'user name' or 'service name' changes.
ja: 認証の状態を消去できない場合に, 'user_name' か 'service_name' が変更されたらサーバの実装は切断しなければならない.

source: No more connections will be forwarded after the first, or after the session channel has been closed.
ja: 最初のもの以降ないしセッションチャンネルの終了以降に, 接続が転送されることはない.

source: This identifier is defined provided that the concatenation of the public key format identifier and the elliptic curve domain parameter identifier (or the method name and the elliptic curve domain parameter identifier) does not exceed the maximum specified by the SSH protocol architecture [RFC4251], namely 64 characters; otherwise, the identifier for that curve is undefined, and the curve is not supported by this specification.
ja: 公開鍵識別子と楕円曲線ドメインパラメータ識別子(もしくは方法の名前と楕円曲線ドメインパラメータ識別子)の連結でこの識別子は定義され提供される. このとき, この識別子はSSH プロトコルアーキテクチャ [RFC4251]で指定された最大長, すなわち 64文字を越えない. そうでなければ, 曲線の識別子が定義されず, この曲線はこの仕様ではサポートされない.

source: If the application receiving this request can control the BREAK length, the following suggestions are made regarding BREAK duration.
ja: このリクエストを受けるアプリケーションが BREAK の長さを制御できるなら, BREAKの持続時間について, 次の示唆がある.

source: Roughly speaking, an N-bit elliptic curve offers the same security as an N/2-bit symmetric cipher, so a 256-bit elliptic curve (such as the REQUIRED nistp256 curve) is suitable for use with 128-bit AES, for example.
ja: おおざっぱにいって, N-ビットの楕円曲線は, N/2-bitの対称暗号と同じセキュリティを提供する. たとえば, (必須の nistp256 曲線のような) 256-bitの楕円曲線は, 128-bitのAECと共に利用するのに適している. example.

source: Using the NETCONF Configuration Protocol over Secure SHell (SSH)
ja: セキュアシェル (SSH) 上での NETCONF 設定プロトコルの利用

source: Implementation Notes
ja: 実装上の注意

source: Security Capabilities of this Model
ja: このモデルのセキュリティ機能

source: There is no clear solution, as different applications may display data in different formats.
ja: 明確な解決法はない. 異なるアプリケーションは異なる形式でデータを表示するかもしれないからだ.

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in [KEYWORDS].
ja: この文書でのキーワード "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", "OPTIONAL" は, [KEYWORDS] で記述されているように解釈される.

source: If the guess was right, key exchange MUST continue using the guessed packet.
ja: 推測が正しければ, 鍵交換は推測されたパケットを用いて続けられる.

source: This memo describes a new key exchange method for the Secure Shell (SSH) protocol.
ja: このメモは, セキュア シェル （ＳＳＨ） プロトコルのための 新しい鍵交換法を記述している.

source: Once the client host's identity is established, authorization (but no further authentication) is performed based on the user names on the server and the client, and the client host name.
ja: 一度クライアントホストの識別が確立すると, (ユーザの)承認(これ以上認証は行なわれない)は, サーバでのユーザ名とクライアントでのユーザ名, クライアントのホスト名に基づいて行なわれる.

source: Implementers SHOULD provide features that make this
ja: 実装者はこの攻撃をより難しくする特徴を提供する必要がある. 例としては, 正当なユーザがいるとわかっているクライアントの部分集合からの接続のみを許可するというものがある.

source: In Section 6, we discuss the motivation for these rekeying recommendations in more detail.
ja: 6節では, これらの再発行の推奨の動機にういてより詳しく議論する.

source: Repeat until p is prime.
ja: pが素数になるまで繰り返し.

source: Encryption .................................................9 6.4.
ja: 暗号化...............................................9 6.4.

source: The RECOMMENDED server authentication mechanism is as follows.
ja: 推奨されるサーバの認証メカニズムは以下だ.

source: As before, the keystream can be pre-computed, and decryption is parallelizable.
ja: 同様に, 鍵ストリームは前処理でき, 復号は並列化できる.

source: The IANA will not assign Channel Connection
ja: IANAは, 0xFE000000 から 0xFFFFFFFF の範囲の チャンネル接続失敗の'reason code' の値は割り当てない.

source: Modification of Information - SSH provides for verification that the contents of each message have not been modified during its transmission through the network by digitally signing each SSH packet.
ja: 情報の改竄 - SSH は, SSH パケットそれぞれに電子的に署名してネットワーク越しの転送の間にそれぞれのメッセージの内容が改竄されていないかの検証を提供する.

source: 2) User authentication MUST begin with public key authentication using ECDSA-256/384 with X.509v3 certificates (see Section 4).
ja: 2) ユーザ認証は, X.509v3 証明書で ECDSA-256/384 を用いる 公開鍵認証で始められなければならない (4節を参照).

source: Removing a Public Key
ja: 公開鍵の削除

source: It is important to understand the SNMP architecture [RFC3411] and the terminology of the architecture to understand where the Transport Model described in this memo fits into the architecture and interacts with other subsystems within the architecture.
ja: このメモで記述するトランスポートモデルがアーキテクチャに適合しアーキテクチャの中で他のサブシステムと相互作用するのがどこで行なわれるか理解するために, SNMP アーキテクチャ [RFC3441] と アーキテクチャの用語を理解するのが重要だ.

source: Otherwise, hashes that are meant to be computed in parallel by both peers will have differing values.
ja: そうしないと, それぞれの側で並列に計算されるハッシュが異なる値を持つことになる.

source: o Encryption, integrity, and compression algorithms, separately for each direction.
ja: o 通信の方向のそれぞれに対する暗号化や完全性, 圧縮のアルゴリズム

source: A detailed discussion on the security considerations of elliptic curve domain parameters and the ECDH, ECDSA, and ECMQV algorithms can be found in Appendix B of [SEC1].
ja: 楕円曲線ドメインパラメータとECDHやECDSA, ECMQVアルゴリズムのセキュリティの考察についてより詳しい議論は, [SEC1] の付録Bにある.

source: The transport layer will typically be run over a TCP/IP connection, but might also be used on top of any other reliable data stream.
ja: トランスポート層は, 典型的には TCP/IP接続の上で動くことを想定しているが, 他の信頼できるデータストリームの上で使ってもよい.

source: Future Assignments ..................................8 4.3.4.
ja: 将来の割り当て ..................................8 4.3.4.

source: This encourages acceptance by the community and allows for ease of implementation, which hopefully leads to a more secure system.
ja: コミュニティが受け入れやすくし実装を容易にしている. これにより, うまくいけばより安全なシステムを構成できる.

source: The Authentication Protocol Framework
ja: 認証プロトコルのフレームワーク

source: The agent MUST NOT process any RPC commands received on the current session after the <close-session> command.
ja: エージェントは, <close-session> コマンドの後で現在のセッションで受け取ったすべての RPC コマンドを処理してはならない.

source: In addition, this document defines a standard textual representation for SSH public key fingerprints.
ja: さらに, この文書は, SSH公開鍵の指紋の標準のテキスト表現を定義する.

source: The SNMPv1 and SNMPv2c message processing described in [RFC3584] (BCP 74) always selects the SNMPv1 or SNMPv2c Security Models, respectively.
ja: [RFC3584] (BCP74) で定義されているSNMPv1 と SNMPv2c メッセージ処理は, それぞれ SNMPv1 か SNMPv2c セキュリティモデルを常に選択する.

source: New primes can be generated in the background.
ja: バックグラウンドで新しい素数は生成できる.

source: If unsuccessful, the transport connection is closed, the snmpSshtmSessionNoChannels counter is incremented, an error indication is returned to the calling module, and processing stops for this message.
ja: ユーザ認証が失敗したら, トランスポート接続は閉じられ, snmpSshtmSessionNoChannels カウンタがインクリメントされ, エラー表示が呼び出し元モジュールに返されて, このメッセージに対する処理が停止する.

source: It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.
ja: この MIB モジュールのインスタンスへのアクセスを提供するSNMP エンティティが, 実際にオブジェクトに GET や SET (change/create/delete) する正当な権限を持っている プリンシパル(ユーザ)にのみオブジェクトへのアクセスを提供するように適切に設定されているかを保証するのは, 顧客/運用者の責任だ.

source: Essentially, a different sequence number in each packet ensures that at least this one input to the MAC function will be unique and will provide a nonrecurring MAC output that is not predictable to an attacker.
ja: 本来, それぞれのパケットで異なるシーケンス番号は, 少なくともMAC関数への1つの入力がユニークで攻撃者に予測不可能な再現することのないMACの出力を提供することを保証する.

source: Ignored Data Message .....................................26 11.3.
ja: 無視データメッセージ............................26 11.3.

source: o The User Authentication Protocol [RFC4252] authenticates the client-side principal to the server.
ja: o ユーザ認証プロトコル [RFC4252] は, クライアント側のユーザをサーバに認証する.

source: An example is a request to start TCP/IP forwarding for a specific port.
ja: 例を挙げると, 特定のポートに対するTCP/IP転送の開始の要求だ.

source: More information about the method name and HMAC can be found in Section 6.4.
ja: 認証法の名前とHMACについてのさらなる情報は, 6.4節にある.

source: 2 VQUIT The quit character (sends SIGQUIT signal on POSIX systems).
ja: 2 VQUIT 終了文字(POSIX シテムでは, SIGQUITを送る).

source: The transport level will continue to process its own messages.
ja: トランスポートのレベルでは, トランスポート自身のメッセージを処理し続ける.

source: The authentication protocol and this authentication method depend on the security of the underlying SSH transport layer.
ja: 認証プロトコルとこの認証法は, 基盤となっているSSHトランスポート層のセキュリティに依存する.

source: This is the public key that will be used for authentication.
ja: この公開鍵は認証に利用される.

source: But in practice, the secure shell dataflow will come in bursts, with the length of each burst strongly correlated to the length of the underlying binary packets.
ja: しかし実際には, セキュアシェルのデータフローは, 基底のバイナリパケットの長さに強く関連する長さを持つ塊ごとに流れる.

source: The server MAY provide a method for administrators to disallow the appearance of a host in this list.
ja: サーバは, このリスト中に特定のホストの出現を認めないための管理者用の方法を提供してもよい.

source: The hashing algorithm defined by this method name is the SHA2 family of hashing algorithms [FIPS-180-3].
ja: この名前で定義されるハッシュアルゴリズムは, SHA2ファミリのハッシュアルゴリズム [FIPS-180-3] だ.

source: This protocol depends on the SSH protocol itself, the GSS-API, any underlying GSS-API mechanisms that are used, and any protocols on which such mechanisms might depend.
ja: このプロトコルは SSHプロトコル自体, GSS-API, 利用されるすべての基底のGSS-APIメカニズム, それらのメカニズムに依存するすべてのプロトコルに依存している.

source: After the ssh-connection service is established, the SSH client will open a channel of type "session", which will result in an SSH session.
ja: ssh-connection サービスが確立したら, クライアントは SSHのセッションとなる "session" タイプのチャンネルを開始する.

source: Messages MUST NOT be sent through an existing SSH session that was established using a different tmSecurityName.
ja: 異なる tmSecruityName を用いて確立された既存の SSH セッションを通してメッセージを送ってはならない.

source: The 'host to connect' and 'port to connect' specify the TCP/IP host and port where the recipient should connect the channel.
ja: 'host to connect' と 'port to connect' は, 受信側がチャンネルに接続する ＴＣＰ/IP ホストとポートを指定する.

source: The key exchange method, public key algorithm, symmetric encryption algorithm, message authentication algorithm, and hash algorithm are all negotiated.
ja: 鍵交換法, 公開鍵アルゴリズム, 対称暗号アルゴリズム, メッセージ認証アルゴリズム, ハッシュアルゴリズムはすべて交渉によって決まる.

source: If missing, the SNMP securityName should be used.
ja: なければ, SNMP securityName が用いられる.

source: IANA assigned port <830> for this purpose.
ja: IANA は, この目的のためにポート <830> を割り当てた.

source: They are in a name space private to this document and not assigned by IANA.
ja: これらはこの文書で閉じた名前空間の中にあり, IANAによって割り当てられていない.

source: The tmSecurityName MUST be a human-readable name (in snmpAdminString format) representing the identity that has been set according to the procedures in Section 5.
ja: tmSecurityName は 5節の手順に従って設定される識別情報を表す (snmpAdminString 形式の)人間に可読な名前でなければならない.

source: There are several aspects that define a public key type:
ja: 公開鍵の種類を定義するいくつかの側面がある:

source: The public key algorithm and the SSHFP algorithm number MUST match.
ja: 公開鍵のアルゴリズムと SSHFP のアルゴリズム番号は, 一致しなければならない.

source: If the server does not support some algorithm, it MUST simply reject the request.
ja: サーバがアルゴリズムをサポートしていなければ, 要求を単に拒否しなければならない.

source: Note that this may require special handling for connections coming through a firewall.
ja: これは, ファイアウォール越しに来る接続には特別の扱いが必要となることに注意.

source: Set tmSessionID in the tmStateReference cache to an implementation-dependent value to identify the session.
ja: セッションを識別するために実装依存の値を tmSessionID として tmStateReference キャッシュに設定する.

source: The SSH user authentication method name "gssapi-with-mic", to name the GSS-API user authentication method defined in Section 3.
ja: SSH ホスト公開鍵アルゴリズム名 "gssapi-with-mic" で, 3 節で定義した GSS-API ユーザ認証法を指定する.

source: Initial Assignments ................................10 4.5.3.
ja: 初期の割り当て................................10 4.5.3.

source: The SSH authentication protocol runs on top of the SSH transport layer protocol and provides a single authenticated tunnel for the SSH connection protocol.
ja: SSH認証プロトコルは, SSHトランスポート層プロトコルの上で動作し, SSHコネクションプロトコルのための単一の認証されたトンネルを提供する.

source: Client implementations SHOULD reject these messages; they are normally only sent by the client.
ja: クライアントの実装は, これらのメッセージを拒否する必要がある. これらは通常クライアントからのみ送られる.

source: How this credential configuration is done is implementation- and deployment-specific.
ja: この資格情報の設定をどう行なうかは, 実装と配置に依存する.

source: Line Termination Characters ................................2 3.2.
ja: 行終端文字 ................................2 3.2.

source: The following example illustrates the use of an X.509v3 certificate for a public key for the Digital Signature Algorithm when used in a Diffie-Hellman key exchange method.
ja: 以下の例で, Diffie-Hellman 鍵交換法が用いられる場合のデジタル署名アルゴルズムの公開鍵として X.509v3 証明書が用いられる場合を示す.

source: This is described in [SSH-CONNECT].
ja: これは, [SSH-CONNECT] で記述されている.
